[{"when":"March 2023","company":"MZLA Technologies Corporation","position":"Staff Engineer","description":"<p>Primarily focused on backend engineering within Thunderbird. Leading internal efforts to bring Rust\nto the codebase, enabling streamlined and safe development of new components and libraries, requiring\nupstream changes within the Firefox code base to support the workflow with minimal maintainence overhead.\n<\/p>\n<p>Working on parallel Rust projects such as the Linux system tray, enabling easier FFI paths and a strategy\nto replace aging systems in an isolated component-by-component fashion.\n<\/p>\n"},{"when":"February 2022 - July 2022","company":"Codethink","position":"Senior Software Engineer","description":"<p>Worked on various new approaches to software testing and safety, pioneered internal processes\n<\/p>\n"},{"when":"July 2020-","company":"Serpent OS","position":"Lead / Founder","description":"<p>Founder and “BDFL” of the Serpent OS project, a\nrelatively new from-scratch Linux distribution with a\nfocus on community sustainability and next\ngeneration features.\nCreating a brand new package manager using Rust\nto offer a deduplicating, atomically updating, “forever\nrolling” operating system for multiple CPU\narchitectures with a focus on cloud/server\napplications.\n<\/p>\n<p>Integrating the LLVM/clang toolchain by default, and\nvia boulder we explore various ways to optimise package\nbuilds using LTO/PGO/BOLT/etc, along with tuning for various\nhardware configurations.\n<\/p>\n"},{"when":"August 2019-","company":"Lispy Snake, Ltd","position":"Chief Executive Officer","description":"<p>Founded a software development company to\noversee the development of a new content/game\nengine written in the D programming language,\nhighly modular and containing an optimised Entity\nComponent System at the heart of the architecture.\nCurrently undergoing restructuring so that a single\ncompany is responsible for commercial entwining of\nofferings of both the Serpent Engine and Serpent OS,\nchiefly in automotive applications.\n<\/p>\n"},{"when":"2018-2019","company":"Intel Corporation","position":"Senior Software Engineer","description":"<p>Worked between UK, Ireland, France, US, whilst\nmentoring teams in GDC and PDX. Continued in\npivotal roles on Clear Linux, bringing core features up\nto acceptable enterprise levels.\nLed an internal effort to bring the standardised Clear\nLinux Developer Edition, provided to newly\nonboarded OTC engineers as their default Linux\n(GNOME) development experience, complete with\nVPN + Exchange access.\n<\/p>\n<p>Helped to bootstrap the distro, as well as working on\nenabling further optimisations with GCC and binutils to\ndeliver automatic optimisations for packages, including:\n<\/p>\n<ul>\n<li>PGO\n<\/li>\n<li>LTO\n<\/li>\n<li>AutoFDO\n<\/li>\n<li>FMV (Functioning Multi Versioning)\n<\/li>\n<\/ul>\n<p>Additionally provided the foundations for a Docker fork\nusing a custom Qemu hypervisor, which later grew into the\n\"Clear Containers\" project, later becoming Kata Containers.\n<\/p>\n"},{"when":"2012-2017","company":"Solus Project","position":"Founder / Project Lead","description":"<p>Originally founded as SolusOS, a Debian derivative,\nreborn under the name “Solus Project” due to a\ntrademark dispute over the term “OS”. Responsible\nfor all daily running of the project, including security\nupdates and releases. Created the Budgie Desktop\nalong with a totally from-scratch Linux distribution\nwhich still enjoys popularity to this day (14th most\npopular in the world according to DistroWatch, 3rd\nbefore I left the project.)\n<\/p>\n"},{"when":"2013-2017","company":"Intel Corporation","position":"Software Engineer","description":"<p>Started out as a Linux distribution engineer for the\nTizen project, pivoting quickly to bootstrap the Clear\nLinux project through various iterations until the\nversion seen publicly today. Took a 1 year hiatus to\nbootstrap FOSS projects.\n<\/p>\n<p>Key accomplishment:\n<\/p>\n<ul>\n<li>Officially broke Python.\n<\/li>\n<\/ul>\n"},{"when":"2012-2013","company":"ElasticHosts","position":"Software Engineer","description":"<p>Started at ElasticHosts improving the provisioning\nsystem.\n<\/p>\n<p>Then reworked the in-house fork of Debian to no\nlonger rely on complete static linking due to security\nissues, rewrote the init system to be faster on RAID\nstorage, and improved I/O throughput orders of\nmagnitude for all ElasticHosts customers by working\nin the (then) new LVM SSD Cache capability,\ndramatically reducing latency.\n<\/p>\n"}]